In [100]:
import pandas as pd
import psycopg2 as pg

In [101]:
db_conn = pg.connect("postgresql://wheretolive:wheretolive@192.168.86.145:5432/wheretolive")

In [102]:
zip_codes = (8180, 4600, 4800, 3004, 6300, 8001, 1201, 6260)

In [103]:
sql = """
select town.zip_code, town.name, 120000*(tax_rate.rate/100) as taxes_chf from tax_rate
join town on town.bfs_nr = tax_rate.bfs_nr
where 
	profile = 'married_2_children_2_salaries' 
	and max_income = 125000 
	and town.zip_code in (8180, 4600, 4800, 3004, 6300, 8001, 1201, 6260)
	and not name in ('Zugerberg', 'Reidermoos', 'Hintermoos', 'Mehlsecken')
order by tax_rate.rate asc
"""

In [104]:
df = pd.read_sql(sql, db_conn)
df.head(10)

   zip_code      name    taxes_chf
0      6300       Zug   982.989000
1      1201    Genève  2762.659409
2      8180    Bülach  4320.000000
3      8001    Zürich  4454.400000
4      4800  Zofingen  6548.484000
5      6260    Reiden  8510.700000
6      4600     Olten  9357.043800
7      3004      Bern  9544.654080

In [105]:
sql = """
select zip_code, sum(rate)*24 as health_insurance_chf from
	(select zip_code, min_birth_year, franchise, avg(rate) as rate from health_insurance_rate
	where zip_code in (8180, 4600, 4800, 3004, 6300, 8001, 1201, 6260)
	and franchise in (2500, 0)
	and min_birth_year in (2020, 1994)
	group by zip_code, min_birth_year, franchise) as tab
	group by zip_code
"""

In [106]:
df_health = pd.read_sql(sql, db_conn)
df_health.head(10)

   zip_code  health_insurance_chf
0      1201          14476.477612
1      3004          12311.301176
2      4600          10156.065455
3      4800           9481.385714
4      6260           8245.909756
5      6300           8262.905660
6      8001          11659.869767
7      8180           9241.221176

In [107]:
sql = """
select zip_code, avg(price)*12 as rent_chf from accomodation
where zip_code in (8180, 4600, 4800, 3004, 6300, 8001, 1201, 6260) 
and rooms <= 5.5 and rooms >= 4.5 and is_rent
group by zip_code
"""

In [108]:
df_acc = pd.read_sql(sql, db_conn)
df_acc.head()

   zip_code      rent_chf
0      4800  23312.842105
1      8001  91692.000000

In [109]:
df = df.merge(df_health)
df = df.merge(df_acc)
df.head(10)

   zip_code      name  taxes_chf  health_insurance_chf      rent_chf
0      8001    Zürich   4454.400          11659.869767  91692.000000
1      4800  Zofingen   6548.484           9481.385714  23312.842105

In [111]:
df['total'] = df['taxes_chf'] + df['health_insurance_chf'] + df['rent_chf']
df['percent_of_income'] = (df['total']/120000)*100
df = df.sort_values(by='total')
df.head(10)

,zip_code,name,taxes_chf,health_insurance_chf,rent_chf,total,percent_of_income
1,4800,Zofingen,6548.484,9481.385714,23312.842105,39342.711820,32.785593
0,8001,Zürich,4454.400,11659.869767,91692.000000,107806.269767,89.838558